Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-43-53.tmx
Source language: bo
Languages: en

source: ཁོང་དུ་ཆུད་པར་བྱས་ཀྱང་མཐར་ཐུག་པར་མ་གྱུར་ཏེ་སྔོན་ཁོང་དུ་ཆུད་པ་ལ་བཟླས་ཏེ། ཁོང་དུ་ཆུད་པར་བྱས་པའང་མེད་དོ་སྔོན་ཐོས་པ་ལ་བཟླས་ཏེ། ཐོས་བར་བྱ་བའང་མེད་དོ།
en: Nevertheless, I did not comprehend them in their entirety, even though I never perceived again what I had perceived before, even though I did not hear again what I had already heard before.

source: །རིགས་ཀྱི་བུ་དེ་ལྟར་དོན་ཐམས་ཅད་གྲུབ་པ་བཙུན་མོའི་འཁོར་གྱི་ནང་ན་བཞུགས་ཤིང་བུད་མེད་ཀྱི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བར་བཞུགས་པའི་ཚེའང་ཁོ་མོ་ནི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་དུས་གསུམ་གྱི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ལ་ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་པའི་ཚུལ་རྒྱ་མཚོ་ཁོང་དུ་ཆུད་པར་བྱ་བས་ཡོངས་སུ་འཇུག་གོ །རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་རྣམ་པར་ལྟ་བུའི་ཡུལ་འདི་ཤེས་ཏེ།
en: “Noble one, in that way, when I was in the harem of Sarvārtha­siddha, who had an entourage of a crowd of queens, through an ocean of the ways of comprehending the realm of phenomena I perceived in each of his pores an ocean, without end or middle, of the ways of the three times. “Noble one, I know and practice only this bodhisattva liberation called the miraculous manifestations at the birth of bodhisattvas throughout all the perceptions of countless kalpas . How could I know the conduct, or teach the treasure of qualities, without exception, of the bodhisattvas who engage in an ocean, without end or middle, of the ways of methods; who manifest the perception of bodies in shapes that accord with those of all beings; who manifest conducts that accord with the aspirations of all beings; who emit clouds of emanations with infinite colors from all their pores;

source: མཉམ་པར་གཞོག་པར་ཟད་ན་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་ཐབས་ཀྱི་ཚུལ་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ལ་ཞུགས་པ་སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་ཞིང་འདྲ་བའི་དབྱིངས་སུ་གནས་པའི་ལུས་རྣམ་པར་དམིགས་པ་ཡོངས་སུ་སྟོན་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་མ་མཐུན་པར་སྤྱོད་པ་ཡོངས་སུ་སྟོན་པ་བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ཁ་དོག་མཐའ་ཡས་པའི་སྤྲུལ་པའི་སྤྲིན་རབ་ཏུ་འགྱེད་པ་ལུས་མེད་པའི་ཆོས་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་རང་བཞིན་ཤིན་ཏུ་རྣམ་པར་དག་པ་ནམ་མཁའི་མཚན་ཉིད་དུ་འགྲོ་བའི་རང་བཞིན་ཁོང་དུ་ཆུད་པས་རྣམ་པ་རྟོག་པ་མེད་པ་ཐམས་ཅད་དུ་རྗེས་སུ་སོང་བའི་བློ་རྣམ་པར་གདོན་མི་ཟ་བས་དེ་བཞིན་གཤེགས་པ་དང་མཉམ་པ་རྣམ་པར་འཕྲུལ་པ་ལ་བརྩོན་པ་རྣམ་པར་ཐར་པའི་ཡུལ་མཐའ་དང་དབུས་མེད་པས་རྣམ་པར་འཕྲུལ་པ་ལ་ཞུགས་པ་ཆོས་ཀྱི་དབྱིངས་ཤིན་ཏུ་རྒྱ་ཆེན་པོར་སེམས་བསྐྱེད་པས་འཇུག་པ་ལ་རྣམ་པར་སྤྱོད་ཅིང་དབང་བསྒྱུར་བ་ཆོས་ཀྱི་གནས་སྒོ་ཐམས་ཅད་དང་ལྡན་པའི་རྣམ་པར་ཐར་པ་རྒྱ་མཚོ་ལ་རྣམ་པར་རྩེ་བ་དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ་ཡོན་ཏན་གྱི་གཏེར་མ་ལུས་པར་བསྟན་པར་ནུས་རེ་སྐན།
en: who have the realization, free of thought, of the pure nature of the bodyless essence of the true nature, a nature that has the characteristics of space; who with the certainty of realization at all times are dedicated to miraculous manifestations equal to those of the tathāgatas; who engage in miraculous manifestation through the scope of the liberations, which has no end or middle; who through the generation of motivation have power over entering and remaining in the vast realm of the Dharma; and who revel in an ocean of liberations that possess all the gateways into the levels of the Dharma? “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་ཞབས་ཀྱི་དྲུང་འདི་ཉིད་ན་ཁྲི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་རྒྱན་དང་ལྡན་པ་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་སཱིང་མོའི་སྙིང་པོ་ཅན་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་ལྷ་མོ་སྒྱུ་མ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་འཇིག་རྟེན་གྱི་ཆོས་ཀྱི་དྲི་མ་ཐམས་ཅད་ཀྱིས་མི་གོས་པ་ཡིན་པ་དང་། དེ་བཞིན་གཤེགས་པ་མཆོད་པའི་ནན་ཏན་ལ་རྒྱུན་མི་ཆད་པ་ཡིན་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་ལས་ཀྱི་མཐའ་ཐམས་ཅད་ལས་ཕྱིར་མི་ལྡོག་པ་ཡིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ལ་འཇུག་པ་ལ་སྒྲིབ་པ་ཐམས་ཅད་དང་བྲལ་བར་འགྱུར་བ་ཡིན་པ་དང་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་སྤྱོད་པ་ཐམས་ཅད་ལ་གཞན་གྱི་དྲིང་མི་འཇོག་པ་ཡིན་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་མངོན་དུ་གྱུར་པར་གནས་པ་ཡིན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྡུ་བའི་ནན་ཏན་ལས་ཕྱིར་མི་ལྡོག་པ་ཡིན་པ་དང་། ཕྱི་མའི་མཐའི་མུར་ཐུག་པའི་བསྐལ་པར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ལ་གནས་པར་བྱ་བ་ལས་ཕྱིར་མི་ལྡོག་པ་ཡིན་པ་དང་། ཐེག་པ་ཆེན་པོའི་སྨོན་ལམ་ལས་ཕྱིར་མི་ཟློག་པ་ཡིན་པ་དང་འགྲོ་བ་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་ཡོངས་སུ་གཟུང་བ་དང་རྣམ་པར་སྤེལ་བ་ལ་སྒྱིད་ལུག་པར་མི་འགྱུར་བ་ཡིན་པ་འདྲིས་ཤིག །དེ་ནས་ཤཱཀྱའི་བུ་མོ་གོ་པས་རྣམ་པར་ཐར་བའི་སྒོའི་ཚུལ་འདི་ཉིད་ཡོངས་སུ་བསྟན་པའི་ཕྱིར་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Here at the feet of the Bhagavat Vairocana, upon a precious throne with various adornments that has in its center a lotus made of the kings of precious jewels, is the mother of the bodhisattva, whose name is Māyādevī. Go to her and ask her, ‘How are bodhisattvas who practice bodhisattva conduct undefiled by any of the stains of this world? How do bodhisattvas have an uninterrupted dedication to making offerings to the tathāgatas? How are bodhisattvas irreversible from attaining the final accomplishment of their activities? How are they free from obscurations in their entry into bodhisattva liberations? How are they without expectation of a reward from others in all their bodhisattva conduct? How do they have the direct perception of all the tathāgatas? How do they never lapse from their dedication to gathering all beings? How do they never lapse from remaining in all bodhisattva conduct until the last future kalpa?

source: །ཡང་དག་བྱང་ཆུབ་སྤྱོད་ལ་བརྩོན་པ་ཡི།
en: How do they never turn back from the prayers of the Mahāyāna? How do they never lose heart in maintaining and increasing the roots of merit of all beings?’ ” Then at that time, Gopā, the Śākya maiden, in order to teach completely this gateway to liberation, through the blessing of the Buddha recited these verses:

source: །སེམས་ཅན་དམ་པ་སེམས་ཅན་སུས་མཐོང་བ།
en: “The beings who see the supreme beings Who are dedicated to perfect bodhisattva conduct,

source: །མོས་པའི་སེམས་སམ་ཁོང་ཁྲོ་ལྡན་ཡང་རུང་།
en: Whether they are attracted or in enmity,

source: །དེ་ཡི་བསྡུ་བས་ཀུན་ཀྱང་ཡོངས་སུ་འདུ།
en: All become gathered by him. “I remember as many kalpas

source: །ཞིང་བརྒྱའི་རྡུལ་ཕྲན་རབ་ཏུ་ཕྲ་སྙེད་ཀྱི། །བསྐལ་པ་མང་པོ་ཁོ་མོས་འདི་ནས་དྲན།
en: As there are atoms in a hundred realms.

source: །དེ་ཡི་ཕ་རོལ་བསྐལ་པ་རྣམ་བརྒྱན་ལ།
en: Beyond those there was the Vyūhasa kalpa,

source: །འཇིག་རྟེན་ཁམས་རབ་རི་བོའི་འོད་བྱུང་ངོ་།
en: In which was the perfect world realm Meruprabhā.

source: །དེ་ལ་ཐུབ་པ་སྟོང་ཕྲག་འགྲངས་པ་ནི།
en: “In that world appeared sages

source: །བྱེ་བ་ཁྲག་ཁྲིག་སུམ་ཅུ་དྲུག་བྱུང་སྟེ།
en: To the number of sixty sextillion.

source: །དེ་ཀུན་ཐ་མར་ཐུབ་དབང་བྱུང་བ་ནི།
en: The last of those lords of sages

source: །འགྲོ་བའི་སྒྲོན་མ་ཆོས་ཀྱི་རྒྱལ་མཚན་ནོ།
en: Was the lamp for beings Dharmadhvaja.

source: །དེ་ཚེ་རྒྱལ་པོ་དཔལ་གྱི་གཟི་བརྗིད་བྱུང་།
en: “At that time there was the King Śrītejas.

source: །ཐུབ་དབང་དེ་ནི་མྱ་ངན་ཡོངས་འདས་ནས།
en: After the parinirvāṇa of that lord of sages

source: །དགྲ་ཡི་འཁོར་བཅོམ་འཛམ་བུའི་རྒྱལ་མཚན་འདིར།
en: In this Jambudhvaja, he destroyed the armies of his adversaries

source: །བཀའ་ལ་ཐོགས་མེད་མངའ་བདག་དམ་པར་གྱུར།
en: And became a supreme sovereign with commands that could not be disobeyed.

source: །དེ་ལ་བུ་ནི་བརྒྱ་ཕྲག་ལྔ་ཡོད་དེ།
en: “He had five hundred sons, who were

source: །ཀུན་ཀྱང་དཔའ་ཞིང་བརྟུལ་ཕོད་གཟུགས་དང་ལྡན།
en: All courageous, heroic, and handsome,

source: །ཡན་ལག་ཀུན་རྫོགས་རྣམ་པར་དག་པའི་ལུས།
en: With perfectly formed limbs and pure bodies,

source: །གོང་ན་མེད་པའི་དཔལ་གྱིས་རབ་ཏུ་བརྒྱན།
en: And who were unsurpassable and adorned by glory.

source: །རྒྱལ་པོ་སྲས་བཅས་བདེ་གཤེགས་འདུན་པར་གྱུར།
en: “The king and his sons had devotion to the Sugata,

source: །རྒྱལ་པའི་མཆོད་པ་རྒྱ་ཆེན་རབ་ཀྱང་བྱས།
en: And they made vast offerings to the Jina.

source: །དེ་ནི་རྟག་ཏུ་དམ་ཆོས་ཡོངས་བཟུང་པའི།
en: He was always in possession of the good Dharma

source: །ཆོས་ལ་མངོན་བརྩོན་རབ་ཏུ་བརྟན་པར་གྱུར།
en: And unshakably dedicated to the Dharma.

source: །རྒྱལ་པོ་དེ་སྲས་འོད་གཟེར་བཟང་པོ་ནི།
en: “To that king was born a son

source: །སེམས་ཅན་རྣམ་དག་གཞོན་ནུ་འཁྲུངས་གྱུར་པ།
en: Named Prince Suraśmi, a pure being

source: །ཤིན་ཏུ་བལྟ་མཛེས་ཡིད་འོང་གཟུགས་ལྡན་ཏེ།
en: Who was a delight to see and had a beautiful form

source: །ཡན་ལག་མཚན་རབ་སུམ་ཅུ་གཉིས་ཀྱིས་བརྒྱན།
en: And was adorned by the thirty-two supreme signs.

source: །རྒྱལ་སྲིད་ཡོངས་སུ་སྤངས་ནས་མི་ཡི་འཁོར།
en: “He abandoned the kingdom and entered homelessness

source: །བྱེ་བ་ལྔས་བསྐོར་དེ་ཚེ་རབ་ཏུ་བྱུང་།
en: Accompanied by an entourage of fifty million men.

source: །རབ་ཏུ་བྱུང་ནས་བརྩོན་འགྲུས་བརྟན་ལྡན་ཏེ།
en: As a mendicant, he was dedicated with unwavering diligence

source: །རྒྱལ་བའི་ཆོས་ཀྱང་ཡོངས་སུ་གཟུང་བར་གྱུར།
en: And gained completely the Dharma of the Jina.

source: །ཕོ་བྲང་དམ་པ་སྡོང་པོ་ལྡན་པ་ནི།
en: “There was the city named Drumāvatī

source: །གྲོང་མཆོག་བྱེ་བ་སྟོང་གིས་ཀུན་ནས་བསྐོར།
en: Encircled by ten billion excellent towns.

source: །ནགས་ཚལ་ཡལ་ག་སྣ་ཚོགས་དེར་བྱུང་བ།
en: There were forests with a variety of branches,

source: །རབ་ཏུ་སྒྲ་ཞི་བླ་ན་མེད་པའི་དཔལ།
en: Peaceful and silent, with unsurpassable splendor.

source: །དེ་ན་འོང་བཟང་བརྟུལ་ཞུགས་རབ་ལྡན་པ།
en: “There, with perfect discipline, dwelled Suraśmi,

source: །འཇིགས་མེད་ཤེས་རབ་སྤོབས་དང་ལྡན་པ་བཞུགས། །དེས་ནི་སེམས་ཅན་ཉོན་མོངས་སྦྱངས་པའི་ཕྱིར།
en: Who was fearless, wise, and eloquent.

source: །རྒྱལ་པའི་ཆོས་ཀྱང་ཡོངས་སུ་བསྟན་པ་མཛད།
en: He was teaching the Dharma of the Jina In order to purify defiled beings.

source: །ཤེས་རབ་ལྡན་པ་དེ་ནི་བསོད་སྙོམས་ལ།
en: “That wise one, when seeking alms,

source: །སྤྱོད་ལམ་མཛེས་ཤིང་ཆ་བྱད་ཞི་བ་དང་། །མི་གཡེང་སྤྱན་གྱིས་དགོངས་པ་མཁྱེན་བཞིན་དུ།
en: Had a beautiful conduct and peaceful appearance.

source: །ཚུལ་ཟབ་བརྟན་པར་བཞུད་པས་གྲོང་དུ་བྱོན།
en: He went into town in an unwavering, profound manner With mindfulness and undistracted eyes.

source: །གྲོང་མཆོག་དགའ་བའི་རྒྱལ་མཚན་ཞེས་བྱ་བར།
en: “In the best of towns, Nandīdhvaja,

source: །ཚོང་དཔོན་ལེགས་པ་སྙན་གྲགས་དེར་བྱུང་སྟེ།
en: There was the head merchant Suvighuṣṭa­kīrti.

source: །ཁོ་མོ་དེ་ཡི་བུ་མོ་ཡིད་འོང་གྱུར།
en: I was his charming, beautiful daughter

source: །གཟུགས་མཛེས་ལྡན་ཏེ་ཉི་མའི་འོད་ཅེས་བྱ།
en: By the name of Bhānuprabhā.

source: །ཁྱིམ་གྱི་དམ་པ་དེ་ཡི་སྒོ་ནས་སུ།
en: “At the gateway of our perfect house,

source: །འོད་གཟེར་བཟང་པོ་འཁོར་བཅས་ཁོ་མོས་མཐོང་།
en: I saw Suraśmi and his entourage,

source: །ཡན་ལག་མཚན་བརྒྱན་ཤིན་ཏུ་མཛེས་པ་སྟེ།
en: Handsome, his body adorned by the signs,

source: །དེ་ལ་ཁོ་མོ་མོས་པ་མཆོག་ཅིག་སྐྱེས།
en: And I was greatly attracted to him.

source: །དེ་ནི་ཁོ་མོའི་ཁྱིམ་གྱི་སྒོར་བྱོན་ནས།
en: “He came to the gateway to my home,

source: །ནོར་བུ་དེ་ཡི་ལྷུང་བཟེད་ནང་དུ་གསོལ།
en: And I placed a jewel in his alms bowl.

source: །རྒྱན་རྣམས་ཀུན་ཀྱང་བཀྲོལ་ཏེ་མོས་སེམས་ཀྱིས།
en: I also removed all my jewelry,

source: །ཤིན་ཏུ་འདུན་པར་དེ་ལ་བདག་གིས་ཕུལ། །བདེ་གཤེགས་སྲས་པོ་འོད་གཟེར་བཟང་དཔལ་ལ།
en: And with adoration I offered them to him.

source: །འདོད་ཆགས་སེམས་ཀྱིས་མཆོད་པ་རྣམས་བསྒྲུབས་པས།
en: “Because of making an offering through passion To that son of the buddhas, Suraśmiketu,

source: །བསྐལ་པའི་དམ་པ་ཉིས་བརྒྱ་ལྔ་བཅུར་ཡང་།
en: For two hundred and fifty of the longest kalpas

source: །ངན་སོང་གང་དུའང་སོང་བར་མ་གྱུར་ཏོ།
en: I was not reborn in the lower existences.

source: །ལྷ་ཡི་ཡུལ་དུ་ལྷ་རིགས་ལྡན་པར་སྐྱེས།
en: “I was born into divine families in the realms of the devas

source: །མི་ཡི་ཡུལ་དུ་རྒྱལ་པོའི་སྲས་མོར་གྱུར།
en: And in the human world as the daughters of kings. In all those lives he revealed himself to me

source: །ཁ་དོག་མཐའ་ཡས་སྐུ་ཡི་མདོག་མངའ་བས། །ཀུན་ཏུ་ཁོ་མོ་མངོན་པར་ཞལ་ཡང་བསྟན།
en: In bodies that had endless different forms.

source: །བསྐལ་པ་ཉིས་བརྒྱ་ལྔ་བཅུ་འདས་གྱུར་ནས། །སྤྲུལ་འཚོང་གཙོ་མོ་བལྟ་ན་སྡུག་པ་སྟེ།
en: “After two hundred and fifty kalpas had passed,

source: །མི་འཇིགས་བྱེད་པའི་བུ་མོར་སྐྱེས་པར་གྱུར།
en: I was born as the fearless daughter Of the preeminent courtesan Sudarśanā

source: །དེ་ཚེ་ཤིན་ཏུ་སྦྱངས་ཤེས་བྱ་བ་ཡིན།
en: And at that time was known as Saṃcālitā.

source: །རྒྱལ་བུ་གཟི་བརྗིད་འོད་ཀྱི་བདག་མཐོང་ནས།
en: “When I saw Prince Tejodhipati,

source: །ཁོ་མོས་དེ་ལ་དགའ་བས་མཆོད་པ་བྱས།
en: I joyfully made offerings to him.

source: །བདག་ཉིད་དེ་ལ་ཡོངས་སུ་དབུལ་བྱས་ནས།
en: I offered myself to him

source: །ཁོ་མོ་དེ་ཡི་དབང་གྱུར་ཆུང་མར་གྱུར།
en: And became his obedient wife. “Together we made excellent offerings

source: །དྲང་སྲོང་ཆེན་པོའི་སྐུ་མཆོག་ཉི་མ་ལའང་། །བདག་ཅག་བསྡོམས་ཏེ་ལེགས་པར་མཆོད་པ་བྱས།
en: To the great ṛṣi Sūrya­gātra­pravara.

source: །མོས་པས་སངས་རྒྱས་དེ་ཡི་ཞལ་བལྟས་ནས།
en: With devotion I looked upon that buddha’s face,

source: །བདག་གིས་བྱང་ཆུབ་མཆོག་ཏུ་སེམས་ཀྱང་བསྐྱེད།
en: And I developed the aspiration for supreme enlightenment. “During that kalpa, I venerated

source: །རྒྱལ་པ་བྱེ་བ་དྲུག་ཅུ་ཚང་པ་ཡང་། །བསྐལ་བ་དེ་ལ་ཁོ་མོས་རིམ་གྲོ་བྱས།
en: A full six hundred million jinas.

source: །རྒྱལ་བ་དེ་དག་ཐ་མའི་དུས་ཀྱི་ཚེ།
en: In the time of the last of those jinas

source: །སངས་རྒྱས་མོས་པའི་གཟི་བརྗིད་བྱུང་བར་གྱུར།
en: There appeared the Buddha Adhimuktitejas. “In that time, I gained pure Dharma eyes

source: །དེར་ནི་ཁོ་མོའི་ཆོས་མྱིག་རྣམ་པར་དག །ཆོས་ཀྱི་རང་བཞིན་བདག་གིས་ཁོང་དུ་ཆུད།
en: And comprehended the nature of phenomena.

source: །ཚུལ་མྱིན་རྣམ་རྟོགས་རབ་ཏུ་ཞི་བར་གྱུར།
en: Incorrect thinking completely ceased,

source: །དེ་ཚེ་ཚུན་ཆད་ཁོ་མོས་སྣང་བ་ཐོབ།
en: And since that time I have attained illumination. “Since that time, I have seen

source: །རྒྱལ་སྲས་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་ཡང་།
en: The samādhis of the jinas’ progeny.

source: །དེ་ཕྱི་ཚུན་ཆད་རྣམ་པར་མཐོང་བར་གྱུར།
en: In each instant of the mind I observe

source: །སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་རྒྱ་མཚོའི་ཞིང་།
en: An inconceivable ocean of realms in all directions.

source: །བསམ་ལས་རྣམ་འདས་ཕྱོགས་སུ་ཁོ་མོ་འཇུག །ཕྱོགས་རྣམས་ཀུན་གྱི་སྣ་ཚོགས་རྣམ་དག་པའི།
en: “I see in all directions a variety

source: །ཞིང་རྣམས་ཚད་མེད་རྨད་མཐོང་ཁོ་མོས་མཐོང་།
en: Of countless, marvelous pure realms.

source: །མཐོང་ཡང་དེ་དག་ལ་ནི་ཆགས་པ་མེད།
en: I have no attachment to them on seeing them

source: །ཉོན་མོངས་བཅས་ལའང་ཁོང་ཁྲོ་སྡང་བ་མེད།
en: And no aversion toward those that are defiled.

source: །ཞིང་རྣམས་དེ་དག་མ་ལུས་ཐམས་ཅད་ཀྱི།
en: “I see, in every one of those realms,

source: །སྙིང་པོ་བྱང་ཆུབ་སངས་རྒྱས་མ་ལུས་མཐོང་།
en: Every buddha in his bodhimaṇḍa. In each instant of mind I look upon

source: དེ་དག་འོད་ཀྱི་རྒྱ་མཚོ་ཚད་མེད་པའང་།
en: Their immeasurable oceans of light.

source: །སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་རྣམ་པར་བལྟ།
en: “In each instant of mind I comprehend, without impediment,

source: །དེ་དག་འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཡང་། །སེམས་ཅིག་ཐོགས་པ་མེད་པས་ཁོང་དུ་ཆུད།
en: The oceans of their circles of followers.

source: །རྣམ་པར་ཐར་པ་ཚད་མེད་ཐམས་ཅད་དང་། །དེ་དག་ཏིང་འཛིན་མ་ལུས་དེ་བཞིན་ཤེས།
en: In the same way, I know all their samādhis And also their countless liberations.

source: །དེ་དག་སྤྱོད་པ་ཡངས་པའང་ཁོང་དུ་ཆུད།
en: “I comprehend their vast activities, And I know every manner of the bhūmis.

source: །ས་ཚུལ་མ་ལུས་ཀུན་ཀྱང་ཁོ་མོས་ཤེས།
en: I also know, in each instant, the infinite,

source: །སྨོན་ལམ་གྲགས་མེད་རྒྱ་མཚོ་ཆེན་པོ་ཡང་། །སྐད་ཅིག་རེ་རེས་མཐའ་ཡས་ཁོང་དུ་ཆུད།
en: Vast ocean of their countless prayers.

source: །བསྐལ་པ་མཐའ་ཡས་སྤྱད་པ་སྤྱོད་བྱེད་ཅིང་།
en: “Throughout endless kalpas I gazed upon

source: །སྐྱེས་བུ་དམ་པའི་སྐུ་ལ་ལྟ་ལྟ་སྟེ། །དེ་ཡི་བ་སྤུ་རྣམ་པར་འཕྲུལ་བ་ཡང་།
en: The body of the supreme being practicing conduct.

source: །ནམ་ཡང་མུར་ཕྱིན་བདག་གིས་མ་ནུས་སོ།
en: I could never fully know the extent Of the manifestations from his pores. “I saw countless oceans of many realms,

source: །དེ་ཡི་བ་སྤུ་གཅིག་གི་རྩེ་ལ་ཡང་།
en: Even on the tip of a single pore hair.

source: །ཞིང་མང་རྒྱ་མཚོ་གྲངས་ལས་འདས་པ་མཐོང་།
en: I saw them filled with masses of air,

source: །རླུང་གི་ཕུང་པོ་ཆུ་བོ་ཆེན་པོ་དང་། །ས་ཡི་ལྷུན་རྣམས་མེ་ཡིས་ཡོངས་གང་མཐོང་།
en: Great rivers, mountains of earth, and fire. “I perceived a variety of grounds

source: །གཞི་རྣམས་སྣ་ཚོགས་རྣམ་ཕྱེའི་གཟུགས་ལྡན་ཞིང་།
en: Having different forms and various kinds of shapes.

source: །དབྱིབས་ཚུལ་སྣ་ཚོགས་ཁོང་དུ་ཆུད་བྱ་བ།
en: They had a variety of elements and constituents,

source: །དབྱིབས་དང་ལུས་ཀྱི་རྣམ་པས་སྣ་ཚོགས་ཤིང་།
en: Various different kinds of aspects and forms.

source: །ལུས་དང་རྣམ་པ་མཐའ་ཡས་གཟུགས་ལྡན་པའི།
en: “I saw clearly and distinctly countless

source: །བརྗོད་ཡས་ཁམས་རྣམས་ཞིང་རྣམས་རྒྱ་མཚོ་དག །ཚད་མེད་རྣམས་སུ་ཐ་དད་གསལ་བར་མཐོང་།
en: Oceans of realms, worlds beyond description. I saw the jinas who were engaged

source: །ཆོས་ཀྱི་གསུང་གིས་འགྲོ་བ་གདུལ་དོན་དུ། །བརྩོན་བའི་རྒྱལ་བ་དེ་ཉིད་བཞུགས་པ་མཐོང་། །བསྐལ་པར་སྤྱོད་པ་ཡངས་པ་སྤྱོད་པའི་ཚེ།
en: In guiding beings through teaching the Dharma.

source: །སྐུ་ཡི་ཕྲིན་ལས་ཁོ་མོས་དེ་མ་ཤེས།
en: “I cannot comprehend the actions of his body,

source: །གསུང་དང་ཐུགས་མིན་དེ་གཉིས་ཕྲིན་ལས་མིན།
en: Or his speech or his mind, or their actions,

source: །རྫུ་འཕྲུལ་རྣམ་འཕྲུལ་ཐ་དད་ཚུལ་མ་ཤེས།
en: Or his various miraculous manifestations While practicing his vast conduct for kalpas.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཤཱཀྱའི་བུ་མོ་གོ་བའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ཤཱཀྱའི་བུ་མོ་གོ་བ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ཤཱཀྱའི་བུ་མོ་གོ་བའི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the Śākya maiden Gopā, circumambulated the Śākya maiden Gopā many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the Śākya maiden Gopā. Māyādevī

source: བམ་པོ་བཅུ་དྲུག་པ། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལྷ་མོ་སྒྱུ་མའི་གན་དུ་འགྲོ་བར་མངོན་དུ་བལྟས་ནས། སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་གྱི་རྒྱུད་ཀྱི་ཡེ་ཤེས་ལ་ཞུགས་པ་དེས་འདི་སྙམ་དུ་བསམས་སོ། །བདག་གི་དགེ་བའི་བཤེས་གཉེན་འཇིག་རྟེན་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པའི་སྐྱེ་མཆེད་དྲུག་དང་ལྡན་པ། གནས་མེད་པ་ལ་རབ་ཏུ་གནས་པ།
en: Sudhana, the head merchant’s son, on the way to Māyādevī, undertaking the wisdom of practicing the scope of the activity of the buddhas, thought, “By what means can I see the kalyāṇamitras, honor them, meet them, accompany them, learn their qualities, know the field of their speech, understand the succession of their words, and possess the teachings of the kalyāṇamitras who have six āyatanas that have risen above all worlds;

source: ཆགས་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that have transcended all attachments;

source: ཆགས་པ་མེད་པར་འགྲོ་བའི་ལམ་དུ་ཞུགས་པ་ཆོས་ཀྱི་ལུས་ཤིན་ཏུ་རྣམ་པར་དག་པ།
en: who follow the path of unimpeded movement; who have pure Dharma bodies;

source: ལུས་ཀྱི་ལས་སྒྱུ་མས་ལེགས་པར་སྤྲུལ་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that are manifestations of illusory physical activities;

source: ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པས་འཇིག་རྟེན་ན་རྣམ་པར་སྤྱོད་པ། སྨོན་ལམ་སྒྱུ་མའི་གཟུགས་དང་ལུས་སུ་ལྡན་པ། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཡིད་ཀྱི་རང་བཞིན་གྱི་ལུས་དང་ལྡན་པ།
en: who perform conducts in the world that are the illusions of wisdom;

source: མ་སྐྱེས་མ་འགགས་པའི་ལུས་དང་ལྡན་པ། འོངས་པ་མེད་པའི་ལུས་དང་ལྡན་པ།
en: who have forms and bodies from prayer; who have bodies that are not born and do not cease;

source: བདེན་པ་མེད་པ་དང་། བརྫུན་པ་མེད་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that are neither true nor false;

source: མ་འཕོས་མ་ཞིག་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that do not pass away or perish;

source: མ་བྱུང་མི་འཇིག་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that do not originate and are not destroyed;

source: མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that have the single characteristic of having no characteristics;

source: གཉིས་ལ་ཆགས་པ་དང་བྲལ་བའི་ལུས་དང་ལྡན་པ།
en: who have bodies that have no attachment to duality;

source: ཀུན་གཞི་མེད་པ་ལ་གནས་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that are based on having no basis;

source: མི་ཟད་ཅིང་ཉམས་པ་མེད་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that do not decay or diminish;

source: གཟུགས་བརྙན་ལྟར་རྣམ་པར་རྟོག་པ་མེད་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies without thoughts, like reflections;

source: རྨི་ལམ་དང་མཉམ་པར་རྣམ་པར་རྒྱུ་བའི་ལུས་དང་ལྡན་པ་མེ་ལོང་གི་དཀྱིལ་འཁོར་ལྟར་འཕོ་བ་མེད་པའི་ལུས་དང་ལྡན་པ།
en: who have active bodies that are like dreams; who have bodies that do not depart, like the surface of a mirror;

source: །ཕྱོགས་མེད་པ་ལྟར་རབ་ཏུ་ཞི་བར་ཁོང་དུ་ཆུད་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that are established in peace, like the absence of directions;

source: ཕྱོགས་ཀུན་ཏུ་རྒྱས་པར་འགེངས་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that pervade all directions;

source: དུས་གསུམ་དུ་ཐ་མི་དད་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that have no differentiation between the three times;

source: ལུས་མེད་པའི་སེམས་ཀྱི་ལུས་རྣམ་པར་མི་རྟོག་པའི་ལུས་དང་ལྡན་པ།
en: who have bodiless bodies of mind that are bodies without thought;

source: འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་མྱིག་གི་ལམ་ལས་ཡོངས་སུ་འདས་པའི་ལུས་དང་ལྡན་པ།
en: who have bodies that have transcended the path of sight in all worlds;

source: ཀུན་ཏུ་བཟང་པོའི་མྱིག་གི་རྒྱུད་ཀྱིས་རྣམ་པར་ཤེས་པར་བྱ་བས་འདུལ་བའི་ལུས་དང་ལྡན་པ། ཆགས་པ་མེད་པས།
en: who have bodies that have been tamed through the path of completely good vision;

source: ནམ་མཁའི་སྤྱོད་ཡུལ་དང་ལྡན་པ་རྣམས་མཐོང་བར་བྱ་བའམ། བསྙེན་བཀུར་བར་བྱ་བའམ། མངོན་གསུམ་དུ་ཕྲད་པར་བྱ་བའམ། འགྲོགས་པར་བྱ་བ་འམ། མཚན་མ་གཟུང་བར་བྱ་བ་འམ། དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་རིག་པར་ཤེས་པར་བྱ་བའམ། ཚིག་གི་རྒྱུད་ཡོངས་སུ་ཤེས་པར་བྱ་བའམ། གདམས་ངག་ཡོངས་སུ་གཟུང་བར་བྱ་བར་ཐབས་ཇི་ལྟ་བུ་ཞིག་ཏུ་ནུས་པར་འགྱུར་སྙམ་ནས།
en: and who have the unimpeded field of activity of space?”

source: དེ་ལྟར་སེམས་ཤིང་ཡིད་ལ་བྱེད་པ་ལ་བརྩོན་པར་གནས་པའི་ཚེ། གྲོང་ཁྱེར་གྱི་ལྷ་མོ་རིན་ཆེན་མིག་ཅེས་བྱ་བ་ནམ་མཁའི་ལྷ་མོའི་ཚོགས་ཀྱིས་ཡོངས་སུ་བསྐོར་བ་ཞིག་གིས།
en: While he was dedicated to contemplating and pondering this, Ratnanetrā, the goddess of the city, appeared in the sky encircled by a crowd of sky goddesses.

source: བདག་གི་ལུས་རྒྱན་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་བརྒྱན་པ། བདག་གི་ལུས་རྒྱན་གྱིས་རྣམ་པར་ཀླུབས་པར་ནམ་མཁའ་ལ་འདུག་པར་ཉེ་བར་བསྟན་ནས། ལྷ་རྫས་ཀྱི་མེ་ཏོག་རྣམ་པ་དང་། ཁ་དོག་དུ་མ་ཅན་སྙིམ་པ་ནས་མངོན་པར་གཏོར་ཏེ།
en: Her body was adorned by varieties of jewelry, her body was covered in adornments, and she scattered handfuls of divine flowers of many shapes and colors.

source: །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་འཁོར་བའི་ཡུལ་ལ་དགའ་བར་མི་གནས་པས་སེམས་ཀྱི་གྲོང་ཁྱེར་ཡོངས་སུ་བསྲུང་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལ་དམིགས་པས་སེམས་ཀྱི་གྲོང་ཁྱེར་བརྒྱན་པ་ལ་བརྩོན་པར་གྱིས་ཤིག །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཕྲག་དོག་དང་། སེར་སྣ་དང་གཡོ་དང་བྲལ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་ཡོངས་སུ་སྦྱང་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ངེས་པར་རྟོགས་པར་བྱ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་གྱི་ཡོངས་སུ་གདུང་བ་རབ་ཏུ་ཞི་བར་བྱ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ལ་བརྩོན་འགྲུས་ཆེན་པོའི་ཤུགས་རྣམ་པར་སྤེལ་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་རྣམ་པར་སྤེལ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་དང་། བསམ་གཏན་དང་། རྣམ་པར་ཐར་པ་དང་། ཆོས་ཀྱི་གཞལ་མེད་ཁང་ཡངས་པའི་རྣམ་པར་སྤྱོད་པ་ལ་དབང་བསྒྱུར་བས་སེམས་ཀྱི་གྲོང་ཁྱེར་དང་། གནས་ཀྱི་མཛོད་བརྒྱན་པ་དང་། བསྲུང་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཡང་དག་པར་བསྒྲུབས་པའི་ས་ཐམས་ཅད་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རབ་ཏུ་ཐོབ་པར་འཚལ་བས།
en: “Noble one, you should be dedicated to adorning the city of the mind through focusing on the ten strengths of the tathāgatas. “Noble one, you should be dedicated to purifying the city of the mind through being free of envy, greed, and deception. “Noble one, you should be dedicated to pacifying the torment of the city of the mind through realizing the nature of all phenomena. “Noble one, you should be dedicated to increasing the city of the mind through increasing the power of great dedication to the accumulation of omniscience. “Noble one, you should be dedicated to protecting the city of the mind’s treasury of buildings through gaining power over dwelling in the vast divine palaces of the samādhis, samāpattis, dhyānas, liberations, and the Dharma.
